// Импортируем тип
import type { NewsItem } from '../types/news';

export const mockNews: NewsItem[] = [
  {
    id: 1,
    title: 'Новости Центра за Июнь 2025',
    date: '2025-06-01',
    content: 'Дорогие друзья, "Старому коту" как никогда нужна ваша поддержка! Именно там самым трудным месяцем за всё время нашей работы...',
    excerpt: 'Поддержите "Старого кота" в трудный месяц',
  },
  {
    id: 2,
    title: 'Новости Центра за Июнь 2025',
    date: '2025-06-01',
    content: 'Дорогие друзья, "Старому коту" как никогда нужна ваша поддержка! Именно там самым трудным месяцем за всё время нашей работы...',
    excerpt: 'Поддержите "Старого кота" в трудный месяц',
  },
  {
    id: 3,
    title: 'Новости Центра за Июнь 2025',
    date: '2025-06-01',
    content: 'Дорогие друзья, "Старому коту" как никогда нужна ваша поддержка! Именно там самым трудным месяцем за всё время нашей работы...',
    excerpt: 'Поддержите "Старого кота" в трудный месяц',
  },
];